#include <iostream>
#include <iomanip>
using namespace std;
class misal4
{
    public:
    void print();
};

void misal4::print()
{
    cout<<"\n|------------------------------------------------------------|";
    cout<<"\n|ПЭЭМдин муноздомолору                                       |";
    cout<<"\n|------------------|------------------|-------------|--------|";
    cout<<"\n|Процессор         |Жыштыгы (Mgz)     |RAM (Mb)     |Тиби    |";
    cout<<"\n|------------------|------------------|-------------|--------|";
    cout<<"\n|"<<setw(18)<<left<<"Pentium-III"<<"|"<<setw(18)<<233<<left<<"|"<<setw(13)<<" "<<left<<"|"<<setw(8)<<'C'<<left<<"|";
    cout<<"\n|------------------|------------------|-------------|--------|";
    cout<<"\n|"<<setw(18)<<left<<"AMD-К6"<<"|"<<setw(18)<<166<<left<<"|"<<setw(13)<<" "<<left<<"|"<<setw(8)<<'C'<<left<<"|";
    cout<<"\n|------------------|------------------|-------------|--------|";
    cout<<"\n|"<<setw(18)<<left<<"PowerPC-620"<<"|"<<setw(18)<<2000<<left<<"|"<<setw(13)<<" "<<left<<"|"<<setw(8)<<'R'<<left<<"|";
    cout<<"\n|------------------------------------------------------------|";
    cout<<"\n|Тип:C - CISC-процессору, R - RISC-процессору                |";
    cout<<"\n|------------------------------------------------------------|"<<endl;
}